using System.Collections;
using System.Collections.Generic;
using UnityEngine;

// Класс - головний контейнер скрипта
public class Shpargalka : MonoBehaviour
{
    // Ціле число "int" зі значенням 21
    // private - модифікатор доступу до змінної age,
    // забороняє відображення змінної в редакторі Unity та ін. скриптах
    private int age = 21;

    // Дробове число "float" зі значенням 1.58
    // "f" - вказівка на тип даних "float"
    // public - дає можливість бачити змінну у редакторі Unity
    // та у екземплярах об'єкту класса
    public float height = 1.58f;

    // Строка тексту(символів) "string" зі значенням "Алекс"
    // static - дає можливість змінювати значення у всіх екземплярів
    public static string name = "Алекс";

    // Логічний тип даних "bool"
    // Приймає тільки 2 значення: "true" або "false"
    private bool logic = false;

    // Виконується один раз, коли екземпляр об'єкту з'являється
    // на сцені. Ключове слово "void" вказує на те, що ніякі дані
    // не повинні повертатися  ключовим словом "return"
    private void Start()
    // Start - вбудована функція
    {
        // Умовні оператори
        if (logic) // Перевіряє умову яка є логічним "true" або "false"
        {
            // Код, який виконується  у випадку, якщо умова
            // повертає логічне "true"
        }
        else if (!logic) // Перевіряє іншу умову, якщо умова "if" не виконана
            // Знак "!" перед умовою інвертує її значення
            // Приклад: тут logic змінює початкове "false" на "true"
        {
            // Код
        }
        else // Виконується, коли жодна з умов не є дійсною
        {
            // Код
        }

        // Порівняльні оператори

        if (1 < 2) { } // < меньше ніж
        if (1 > 2) { } // > більше ніж
        if (1 <= 2) { } // <= меньше або дорівнює
        if (1 >= 2) { } // >= більше або дорівнює
        if (1 == 2) { } // == дорівнює
        if (1 != 2) { } // != не дорівнює

        // Виконується якщо всі вказані умови вірні
        if (1 == 2 && 2 == 1) { } // && - логічне "та"
        // Виконується якщо хоча б одна вірна
        if (1 == 2 || 2 == 1) { } // || - логічне "або"

        switch (age)
        {
            case 12: // Перевіряє "age" зі значенням "12"
                // Код
                break; 
            case 13:
                // Код
                break;
            default:
                break;
        }

    }
    // Виконується кожен кадр, коли екземпляр об'єкту активний
    private void Update()
    // Undate - вбудована функція
    {
        
    }
}
